import { AlignRight, BarChart2, Heart, MapPin, UserRound } from 'lucide-react'
import { Button } from './ui/button'
import { HiOutlineShoppingBag } from 'react-icons/hi2'
import GlobalSearch from '@/app/_home/global-search'
import Link from 'next/link'

export default function Header() {
  return (
    <>
      <div className='flex items-center px-8 pt-2'>
        <div className='w-[22.75rem]'>
          <Button
            variant='ghost'
            className='gap-2 text-lg text-muted-foreground '
          >
            <MapPin />
            Հայաստան, ք․ Երևան
          </Button>
        </div>
        <Button variant='ghost' className='gap-2 text-lg text-muted-foreground'>
          Դառնալ վաճառող
        </Button>
        <Button variant='ghost' className='gap-2 text-lg text-muted-foreground'>
          Բջջային հավելված
        </Button>
      </div>
      <header className='sticky top-0 z-20 bg-background'>
        <div className='flex justify-between items-center h-24 px-8'>
          <div>
            <img src='/images/logo.png' alt='logo' width={194} height={56} />
          </div>
          <Button variant='ghost' size='icon'>
            <AlignRight />
          </Button>
          <GlobalSearch />
          <div className='flex gap-11 items-center'>
            <Button variant='ghost' size='icon'>
              <svg
                width='48'
                height='48'
                viewBox='0 0 48 48'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'
              >
                <path
                  d='M17.958 28.3167C17.9977 28.4585 18.0652 28.5912 18.1568 28.7072C18.2484 28.8232 18.3622 28.9202 18.4917 28.9927C18.6212 29.0652 18.7639 29.1119 18.9116 29.1299C19.0594 29.1479 19.2093 29.137 19.3527 29.0978C19.4962 29.0585 19.6305 28.9918 19.7478 28.9013C19.8652 28.8108 19.9634 28.6983 20.0368 28.5703C20.1101 28.4423 20.1573 28.3013 20.1755 28.1553C20.1938 28.0093 20.1827 27.8611 20.1431 27.7193L17.958 28.3167ZM11.4511 12.5762C11.3071 12.5346 11.1561 12.5217 11.007 12.5382C10.8579 12.5548 10.7135 12.6004 10.5824 12.6725C10.4513 12.7446 10.3359 12.8417 10.2431 12.9582C10.1502 13.0747 10.0817 13.2082 10.0415 13.3511C10.0012 13.494 9.99014 13.6433 10.0088 13.7905C10.0274 13.9376 10.0755 14.0796 10.1501 14.2083C10.2247 14.337 10.3244 14.4497 10.4435 14.54C10.5625 14.6302 10.6986 14.6962 10.8436 14.7342L11.4511 12.5762ZM37.122 29.0037C37.2696 28.97 37.4088 28.9073 37.5315 28.8195C37.6541 28.7317 37.7577 28.6205 37.8362 28.4925C37.9146 28.3644 37.9663 28.2221 37.9881 28.074C38.01 27.9259 38.0016 27.7749 37.9634 27.6301C37.9252 27.4852 37.858 27.3494 37.7658 27.2306C37.6736 27.1119 37.5583 27.0126 37.4266 26.9386C37.2949 26.8646 37.1495 26.8175 36.9991 26.8C36.8487 26.7825 36.6962 26.795 36.5508 26.8367L37.122 29.0037ZM22.0244 31.7426C22.4928 33.4152 21.4653 35.1819 19.6459 35.6494L20.2156 37.8163C23.2031 37.0502 25.0285 34.0798 24.2095 31.1452L22.0244 31.7426ZM19.6459 35.6494C17.8144 36.1198 15.9769 35.0684 15.5054 33.3809L13.3203 33.9782C14.1364 36.8978 17.2402 38.5809 20.2156 37.8163L19.6459 35.6494ZM15.5054 33.3809C15.037 31.7082 16.0645 29.9415 17.8839 29.4741L17.3142 27.3087C14.3268 28.0748 12.4998 31.0437 13.3203 33.9782L15.5054 33.3809ZM17.8839 29.4741C19.7154 29.0037 21.5529 30.055 22.0244 31.7426L24.2095 31.1452C23.3935 28.2256 20.2896 26.5425 17.3142 27.3072L17.8839 29.4741ZM20.1431 27.7193L16.8911 16.0857L14.706 16.6831L17.958 28.3167L20.1431 27.7193ZM14.026 13.2811L11.4511 12.5762L10.8436 14.7342L13.4201 15.4405L14.026 13.2811ZM16.8911 16.0857C16.6994 15.4134 16.3347 14.8017 15.8326 14.3102C15.3305 13.8187 14.7081 13.4641 14.026 13.2811L13.4231 15.4405C14.0653 15.6168 14.5428 16.0991 14.706 16.6831L16.8911 16.0857ZM23.404 32.5281L37.122 29.0037L36.5523 26.8367L22.8328 30.3612L23.404 32.5281Z'
                  fill='#484D53'
                />
                <path
                  d='M21.0705 18.5569C20.3376 15.936 19.972 14.6248 20.5945 13.5928C21.2156 12.5594 22.5832 12.2085 25.3183 11.5051L28.2196 10.7613C30.9548 10.0594 32.3223 9.70699 33.3998 10.3029C34.4772 10.9002 34.8444 12.2099 35.5758 14.8324L36.354 17.6131C37.0869 20.234 37.4541 21.5453 36.8315 22.5787C36.2089 23.6106 34.8414 23.9631 32.1062 24.665L29.2049 25.4102C26.4698 26.1121 25.1022 26.4631 24.0248 25.8672C22.9474 25.2698 22.5817 23.9601 21.8488 21.3392L21.0705 18.5569Z'
                  stroke='#484D53'
                  strokeWidth='1.5'
                />
              </svg>
            </Button>
            <Button variant='ghost' size='icon'>
              <BarChart2 />
            </Button>
            <Button variant='ghost' size='icon'>
              <Heart />
            </Button>
            <Link href='https://vordan-client.lt-coding.com' target='_blank'>
              <Button variant='ghost' size='icon'>
                <UserRound />
              </Button>
            </Link>
            <Button variant='ghost' size='icon' className='text-2xl'>
              <HiOutlineShoppingBag />
            </Button>
          </div>
        </div>
      </header>
    </>
  )
}
